# Advanced Pandas 4

In [ ]:
import pandas as pd

# 1795. Rearrange Products Table

**Difficulty:** Easy  
**Topics:** SQL, Pandas

## Table: Products

| Column Name | Type    |
|-------------|---------|
| product_id  | int     |
| store1      | int     |
| store2      | int     |
| store3      | int     |

- `product_id` is the primary key (column with unique values) for this table.
- Each row in this table indicates the product's price in 3 different stores: `store1`, `store2`, and `store3`.
- If the product is not available in a store, the price will be `null` in that store's column.

---

## Problem Statement

Write a solution to rearrange the **Products** table so that each row has `(product_id, store, price)`. If a product is not available in a store, do **not** include a row with that `product_id` and `store` combination in the result table.

Return the result table in any order.

---

## Example

### Input: Products Table

| product_id | store1 | store2 | store3 |
|------------|--------|--------|--------|
| 0          | 95     | 100    | 105    |
| 1          | 70     | null   | 80     |

---

### Output

| product_id | store  | price |
|------------|--------|-------|
| 0          | store1 | 95    |
| 0          | store2 | 100   |
| 0          | store3 | 105   |
| 1          | store1 | 70    |
| 1          | store3 | 80    |

---

## Explanation

- **Product 0** is available in all three stores with prices:
  - `store1`: 95, `store2`: 100, `store3`: 105.
- **Product 1** is available in:
  - `store1`: 70 and `store3`: 80.
  - It is not available in `store2`, so no row is included for this combination.

In [ ]:
# melt() is useful to convert a DataFrame from wide format to long format
'''
pd.melt(
    frame,                 # The DataFrame to melt
    id_vars=None,          # Columns to keep as they are (identifier columns)
    value_vars=None,       # Columns to unpivot
    var_name=None,         # Name of the new column for original column names
    value_name="value"     # Name of the new column for original column values
)
'''
# so store1, store2, store3 will be merged into var_name = 'store'

In [ ]:
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:

    table = pd.melt(frame=products,id_vars=['product_id'],value_vars={'store1', 'store2','store3'},var_name='store',value_name='price')
    table = table.dropna(subset=['price'])
    return table

In [ ]:
# another solution 

def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    return pd.melt(products, id_vars = 'product_id', var_name = 'store', value_name = 'price').dropna()

### 1907. Count Salary Categories

**Difficulty**: Medium  
**Topics**: SQL, Pandas  

---

### **Table: Accounts**

| Column Name | Type |
|-------------|------|
| account_id  | int  |
| income      | int  |

- `account_id` is the primary key (column with unique values) for this table.  
- Each row contains information about the monthly income for one bank account.

---

### **Problem Statement**

Write a solution to calculate the number of bank accounts for each salary category. The salary categories are defined as follows:  

1. **Low Salary**: All salaries strictly less than \$20,000.  
2. **Average Salary**: All salaries in the inclusive range [\$20,000, \$50,000].  
3. **High Salary**: All salaries strictly greater than \$50,000.

The result table must contain all three categories. If there are no accounts in a category, return `0`.  

The result table should have the following columns:  

| Column Name      | Description                       |
|------------------|-----------------------------------|
| category         | The salary category ("Low Salary", "Average Salary", or "High Salary"). |
| accounts_count   | The number of bank accounts in the respective category.                |

---

### **Example**

#### **Input**

`Accounts` table:

| account_id | income |
|------------|--------|
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |

#### **Output**

| category       | accounts_count |
|----------------|----------------|
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |

#### **Explanation**:

- **Low Salary**: Account 2.  
- **Average Salary**: No accounts fall into this range.  
- **High Salary**: Accounts 3, 6, and 8.  

---

### **Constraints**
- Return the result table in any order.